tap "homebrew/bundle"
tap "homebrew/cask", "https://mirrors.ustc.edu.cn/homebrew-cask.git"
tap "homebrew/cask-drivers", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-drivers.git"
tap "homebrew/cask-fonts", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-cask-fonts.git"
tap "homebrew/cask-versions", "https://mirrors.ustc.edu.cn/homebrew-cask-versions.git"
tap "homebrew/command-not-found", "https://mirrors.tuna.tsinghua.edu.cn/git/homebrew/homebrew-command-not-found.git"
tap "homebrew/core", "https://mirrors.ustc.edu.cn/homebrew-core.git"
brew "gettext"
brew "aria2"
brew "asyncplusplus"
brew "autoconf"
brew "autojump"
brew "baidupcs-go"
brew "bash-completion"
brew "boost"
brew "brew-cask-completion"
brew "freetype"
brew "glib"
brew "pkg-config"
brew "python@3.9"
brew "ccat"
brew "gcc"
brew "openblas"
brew "tbb"
brew "cfitsio"
brew "clash"
brew "cmake"
brew "cmatrix"
brew "dict"
brew "docker"
brew "unbound"
brew "gnutls"
brew "guile"
brew "fd"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "ffmpegthumbnailer"
brew "open-mpi"
brew "fftw"
brew "fzf"
brew "gh"
brew "glew"
brew "glfw"
brew "glm"
brew "go"
brew "gobject-introspection"
brew "gsl"
brew "highlight"
brew "htop"
brew "icarus-verilog"
brew "lazygit"
brew "libdc1394"
brew "libnova"
brew "libusb"
brew "librtlsdr"
brew "llvm"
brew "lsusb"
brew "minicom"
brew "neofetch"
brew "neovim"
brew "nghttp2"
brew "node"
brew "numpy"
brew "qt@5"
brew "pyqt@5"
brew "opencv"
brew "openjdk"
brew "openjdk@11"
brew "pstree"
brew "zsh-async"
brew "pure"
brew "pv"
brew "qt"
brew "ranger"
brew "ripgrep"
brew "rtags"
brew "sha2"
brew "shellcheck"
brew "smartmontools"
brew "swig"
brew "telnet"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "universal-ctags"
brew "verilator"
brew "w3m"
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zsh"
cask "alacritty"
cask "aria2gui"
cask "clashx"
cask "cool-retro-term"
cask "font-3270-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-maple"
cask "iterm2"
cask "kitty"
cask "mactex"
cask "raycast"
cask "stats"
cask "youdaodict"
